MacgyverLin/VGMPlayer/Software/STM32/HWModule/LCD2.c
#include <stm32f10x.h>
#include "io.h"
#include "LCD2.h"

#define CLK_E

#define BLACK         		 	0x0000
#define DARK_BLUE           	0x0000007F
#define DARK_GREEN          	0x00007F00
#define DARK_CYAN           	(DARK_GREEN | DARK_BLUE)
#define DARK_RED            	0x007F0000
#define DARK_MANGENTA       	(DARK_RED | DARK_BLUE)
#define DARK_YELLOW		      	(DARK_RED | DARK_GREEN)
#define GREY 			     	(DARK_RED | DARK_GREEN | DARK_BLUE)
#define LIGHT_BLUE           	0x000000FF
#define LIGHT_GREEN          	0x0000FF00
#define LIGHT_CYAN           	(LIGHT_GREEN | LIGHT_BLUE)
#define LIGHT_RED            	0x00FF0000
#define LIGHT_MANGENTA       	(LIGHT_RED | LIGHT_BLUE)
#define LIGHT_YELLOW		    (LIGHT_RED | LIGHT_GREEN)
#define WHITE         			(LIGHT_RED | LIGHT_GREEN | LIGHT_BLUE)

#ifdef LCD_TK022F2218
#define SCREEN_WIDTH  320
#define SCREEN_HEIGHT 240
#else
#define SCREEN_WIDTH  480
#define SCREEN_HEIGHT 800
#endif

#ifdef CLK_E
#define TOGGLE_WR() WR.type->BRR = WR.pin; RD.type->BSRR = RD.pin;	RD.type->BRR = RD.pin
#define	SET_DATA(data) D0.type->ODR = data
#define	GET_DATA() ((u16)D0.type->ODR)
#else
#define TOGGLE_WR() WR.type->BRR = WR.pin;	WR.type->BSRR = WR.pin
#define	SET_DATA(data) D0.type->ODR = data
#define	GET_DATA() ((u16)D0.type->ODR)
#endif

#define RGB888(r, g, b) ((r<<16) | (g<<8) | (b))
#define RGB565(r, g, b) (((((u32)r)<<8)&0xf800) | ((((u32)g)<<3)&0x07e0) | ((((u32)b)>>3)&0x001f))
#define RGB444(r, g, b) (((r&0x0f)<<8)  | ((g&0x0f)<<4) | (b&0x0f))


typedef enum
{
	PF_RGB444 = 0,  // 12 bit format
	PF_RGB565,		 // 16 bit format
	PF_RGB666,		 // 18 bit format
	PF_RGB888,		 // 24 bit format
}PixelFormat;

void LCD_Config_GPIO(void)
{
}

void LCD_Reset(void)
{
#ifdef CLK_E	
	RD.type->BRR   = RD.pin; // WR inactive low
	WR.type->BRR   = WR.pin; // RD inactive low
#endif
}

u8 LCD_ReadData(void)
{
	u8 d;

#ifdef CLK_E
	LCD_CS.type->BRR = LCD_CS.pin;

	RD.type->BSRR = WR.pin;
	A0.type->BSRR = A0.pin;
	
	RD.type->BSRR = RD.pin;

	d = D0.type->IDR;

	RD.type->BRR = RD.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#else		
	LCD_CS.type->BRR = LCD_CS.pin;

	A0.type->BSRR = A0.pin;
	RD.type->BRR = RD.pin;

	d = D0.type->IDR;

	RD.type->BSRR = RD.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#endif
	/*
	IO_WRITE(A0, 1);

	IO_WRITE(LCD_CS, 0);

	IO_WRITE(RD, 0);

	d = GPIO_ReadOutputData(D0.type) & 0xff;

	IO_WRITE(RD, 1);

	IO_WRITE(LCD_CS, 1);
	*/

	return d;
}

void LCD_WriteData(u8 data)
{
#ifdef CLK_E
	LCD_CS.type->BRR = LCD_CS.pin;

	RD.type->BRR = WR.pin;
	A0.type->BSRR = A0.pin;
	D0.type->ODR = (D0.type->ODR & 0x0000ff00) | data;
	
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#else	
	LCD_CS.type->BRR = LCD_CS.pin;

	A0.type->BSRR = A0.pin;
	D0.type->ODR = (D0.type->ODR & 0x0000ff00) | data;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#endif
	/*
	u16 d = GPIO_ReadOutputData(D0.type);
	GPIO_Write(D0.type, (d & 0xff00) | data);

	IO_WRITE(A0, 1);

	IO_WRITE(LCD_CS, 0);

	IO_WRITE(WR, 0);

	IO_WRITE(WR, 1);

	IO_WRITE(LCD_CS, 1);
	*/
}

void LCD_WriteCommand0(u8 command)
{
#ifdef CLK_E
	LCD_CS.type->BRR = LCD_CS.pin;

	RD.type->BRR = WR.pin;
	A0.type->BRR = A0.pin;
	D0.type->ODR = (D0.type->ODR & 0x0000ff00) | command;
	
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#else
	LCD_CS.type->BRR = LCD_CS.pin;

	A0.type->BRR = A0.pin;
	D0.type->ODR = (D0.type->ODR & 0x0000ff00) | command;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	LCD_CS.type->BSRR = LCD_CS.pin;
#endif
	/*
	u16 d = GPIO_ReadOutputData(D0.type);
	GPIO_Write(D0.type, (d & 0xff00) | command);

	IO_WRITE(A0, 0);

	IO_WRITE(LCD_CS, 0);

	IO_WRITE(WR, 0);

	IO_WRITE(WR, 1);

	IO_WRITE(LCD_CS, 1);
	*/
}

void LCD_WriteCommand1(u8 command, u8 d0)
{
	u16 d = (D0.type->ODR & 0x0000ff00);
	LCD_CS.type->BRR = LCD_CS.pin;

#ifdef CLK_E
	WR.type->BRR = WR.pin;
	
	A0.type->BRR = A0.pin;
	D0.type->ODR = d | command;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else	
	A0.type->BRR = A0.pin;
	D0.type->ODR = d | command;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif

#ifdef CLK_E
	WR.type->BRR = WR.pin;
	
	A0.type->BSRR = A0.pin;
	D0.type->ODR = d | d0;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else		
	A0.type->BSRR = A0.pin;
	D0.type->ODR = d | d0;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif

	LCD_CS.type->BSRR = LCD_CS.pin;
}

void LCD_WriteCommand2(u8 command, u8 d0, u8 d1)
{
	u16 d = (D0.type->ODR & 0x0000ff00);

	/////////////////////////////////////
	LCD_CS.type->BRR = LCD_CS.pin;

	/////////////////////////////////////
#ifdef CLK_E
	WR.type->BRR = WR.pin;

	A0.type->BRR = A0.pin;	
	D0.type->ODR = d | command;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else		
	A0.type->BRR = A0.pin;
	D0.type->ODR = d | command;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif

	/////////////////////////////////////
	A0.type->BSRR = A0.pin;
	
#ifdef CLK_E	
	WR.type->BRR = WR.pin;
	
	D0.type->ODR = d | d0;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	D0.type->ODR = d | d1;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else
	D0.type->ODR = d | d0;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d1;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif

	/////////////////////////////////////
	LCD_CS.type->BSRR = LCD_CS.pin;
}

void LCD_WriteCommand3(u8 command, u8 d0, u8 d1, u8 d2)
{
	u16 d = (D0.type->ODR & 0x0000ff00);

	/////////////////////////////////////
	LCD_CS.type->BRR = LCD_CS.pin;

	/////////////////////////////////////
#ifdef CLK_E
	WR.type->BRR = WR.pin;

	A0.type->BRR = A0.pin;	
	D0.type->ODR = d | command;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else		
	A0.type->BRR = A0.pin;
	D0.type->ODR = d | command;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif
	/////////////////////////////////////
	A0.type->BSRR = A0.pin;

#ifdef CLK_E	
	WR.type->BRR = WR.pin;
	
	D0.type->ODR = d | d0;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	D0.type->ODR = d | d1;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

