MacgyverLin/VGMPlayer/Software/STM32/HWModule/LCD2.c
			for (i = 0; i <64; i++)
				LCD_WriteData(i * 4);

			for (i = 0; i <64; i++)
			{
				if(i<32)
					LCD_WriteData(i * 8);
				else
					LCD_WriteData(0);
			}
		}
		break;
		
		case PF_RGB444:
		{
		}
		break;			
	}
}

void LCD_SetRegisters()
{
#ifdef LCD_TK022F2218	
	LCD_WriteCommand(0xCB);
	LCD_WriteData(0x39);
	LCD_WriteData(0x2C);
	LCD_WriteData(0x00);
	LCD_WriteData(0x34);
	LCD_WriteData(0x02);

	LCD_WriteCommand(0xCF);
	LCD_WriteData(0x00);
	LCD_WriteData(0XC1);
	LCD_WriteData(0X30);

	LCD_WriteCommand(0xE8);
	LCD_WriteData(0x85);
	LCD_WriteData(0x00);
	LCD_WriteData(0x78);

	LCD_WriteCommand(0xEA);
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);

	LCD_WriteCommand(0xED);
	LCD_WriteData(0x64);
	LCD_WriteData(0x03);
	LCD_WriteData(0X12);
	LCD_WriteData(0X81);

	LCD_WriteCommand(0xF7);
	LCD_WriteData(0x20);


	LCD_WriteCommand(0xC0);    //Power control 
	LCD_WriteData(0x23);   //VRH[5:0] 

	LCD_WriteCommand(0xC1);    //Power control 
	LCD_WriteData(0x10);   //SAP[2:0];BT[3:0] 

	LCD_WriteCommand(0xC5);    //VCM control 
	LCD_WriteData(0x3e); //对比度调节
	LCD_WriteData(0x28);

	LCD_WriteCommand(0xC7);    //VCM control2 
	LCD_WriteData(0x00);  //--

	LCD_WriteCommand(0x21);
	LCD_WriteCommand(0x36);    // Memory Access Control 
	LCD_WriteData(0xC8);
	LCD_WriteCommand(0x3A);
	LCD_WriteData(0x55);

	LCD_WriteCommand(0xB1);
	LCD_WriteData(0x00);
	LCD_WriteData(0x18);

	LCD_WriteCommand(0xB6);    // Display Function Control 
	LCD_WriteData(0x08);
	LCD_WriteData(0x82);
	LCD_WriteData(0x27);

	LCD_WriteCommand(0xF2);    // 3Gamma Function Disable 
	LCD_WriteData(0x00);

	LCD_WriteCommand(0x26);    //Gamma curve selected 
	LCD_WriteData(0x01);

	LCD_WriteCommand(0xE0);    //Set Gamma 
	LCD_WriteData(0x0F);
	LCD_WriteData(0x31);
	LCD_WriteData(0x2B);
	LCD_WriteData(0x0C);
	LCD_WriteData(0x0E);
	LCD_WriteData(0x08);
	LCD_WriteData(0x4E);
	LCD_WriteData(0xF1);
	LCD_WriteData(0x37);
	LCD_WriteData(0x07);
	LCD_WriteData(0x10);
	LCD_WriteData(0x03);
	LCD_WriteData(0x0E);
	LCD_WriteData(0x09);
	LCD_WriteData(0x00);

	LCD_WriteCommand(0XE1);    //Set Gamma 
	LCD_WriteData(0x00);
	LCD_WriteData(0x0E);
	LCD_WriteData(0x14);
	LCD_WriteData(0x03);
	LCD_WriteData(0x11);
	LCD_WriteData(0x07);
	LCD_WriteData(0x31);
	LCD_WriteData(0xC1);
	LCD_WriteData(0x48);
	LCD_WriteData(0x08);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x0C);
	LCD_WriteData(0x31);
	LCD_WriteData(0x36);
	LCD_WriteData(0x0F);

	LCD_WriteCommand(0x11);    //Exit Sleep 
	LCD_WriteCommand(0x29);    //Display on 
	delay_us(120);
#else
	LCD_WriteCommand0(0xB9);  // SET password
	LCD_WriteData(0xFF);
	LCD_WriteData(0x83);
	LCD_WriteData(0x69);

	LCD_WriteCommand0(0xB1);  //Set Power 
	LCD_WriteData(0x85);
	LCD_WriteData(0x00);
	LCD_WriteData(0x34);
	LCD_WriteData(0x07);
	LCD_WriteData(0x00);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x2A);
	LCD_WriteData(0x32);
	LCD_WriteData(0x3F);
	LCD_WriteData(0x3F);
	LCD_WriteData(0x01); //update VBIAS
	LCD_WriteData(0x3A);
	LCD_WriteData(0x01);
	LCD_WriteData(0xE6);
	LCD_WriteData(0xE6);
	LCD_WriteData(0xE6);
	LCD_WriteData(0xE6);
	LCD_WriteData(0xE6);

	LCD_WriteCommand0(0xB2);  	// SET Display  480x800
	LCD_WriteData(0x00);
	LCD_WriteData(0x20);  		//23    
	LCD_WriteData(0x05); 		//03
	LCD_WriteData(0x05);  		//03
	LCD_WriteData(0x70);
	LCD_WriteData(0x00);
	LCD_WriteData(0xFF);
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);
	LCD_WriteData(0x03);
	LCD_WriteData(0x03);
	LCD_WriteData(0x00);
	LCD_WriteData(0x01);

	LCD_WriteCommand0(0xB4);  	// SET Display  480x800
	LCD_WriteData(0x00);
	LCD_WriteData(0x18);
	LCD_WriteData(0x80);
	LCD_WriteData(0x06);
	LCD_WriteData(0x02);

	LCD_WriteCommand0(0xB6);  	// SET VCOM
	LCD_WriteData(0x42);  		// Update VCOM
	LCD_WriteData(0x42);

	LCD_WriteCommand0(0xD5);
	LCD_WriteData(0x00);
	LCD_WriteData(0x04);
	LCD_WriteData(0x03);
	LCD_WriteData(0x00);
	LCD_WriteData(0x01);
	LCD_WriteData(0x04); 		//05 04
	LCD_WriteData(0x1A); 		//28 
	LCD_WriteData(0xff);  		//70
	LCD_WriteData(0x01);
	LCD_WriteData(0x13);		//03  
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);
	LCD_WriteData(0x40);
	LCD_WriteData(0x06);
	LCD_WriteData(0x51);
	LCD_WriteData(0x07);
	LCD_WriteData(0x00);
	LCD_WriteData(0x00);
	LCD_WriteData(0x41);
	LCD_WriteData(0x06);
	LCD_WriteData(0x50);
	LCD_WriteData(0x07);
	LCD_WriteData(0x07);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x04);
	LCD_WriteData(0x00);

	///Gamma2.2 
	LCD_WriteCommand0(0xE0);
	LCD_WriteData(0x00);
	LCD_WriteData(0x13);
	LCD_WriteData(0x19);
	LCD_WriteData(0x38);
	LCD_WriteData(0x3D);
	LCD_WriteData(0x3F);
	LCD_WriteData(0x28);
	LCD_WriteData(0x46);
	LCD_WriteData(0x07);
	LCD_WriteData(0x0D);
	LCD_WriteData(0x0E);
	LCD_WriteData(0x12);
	LCD_WriteData(0x15);
	LCD_WriteData(0x12);
	LCD_WriteData(0x14);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x17);
	LCD_WriteData(0x00);
	LCD_WriteData(0x13);
	LCD_WriteData(0x19);
	LCD_WriteData(0x38);
	LCD_WriteData(0x3D);
	LCD_WriteData(0x3F);
	LCD_WriteData(0x28);
	LCD_WriteData(0x46);
	LCD_WriteData(0x07);
	LCD_WriteData(0x0D);
	LCD_WriteData(0x0E);
	LCD_WriteData(0x12);
	LCD_WriteData(0x15);
	LCD_WriteData(0x12);
	LCD_WriteData(0x14);
	LCD_WriteData(0x0F);
	LCD_WriteData(0x17);
	delay_us(10);

	///DGC Setting 
	LCD_WriteCommand0(0xC1);
	LCD_WriteData(0x01);
	//R 
	LCD_WriteData(0x04);
	LCD_WriteData(0x13);
	LCD_WriteData(0x1a);
	LCD_WriteData(0x20);
	LCD_WriteData(0x27);
	LCD_WriteData(0x2c);
	LCD_WriteData(0x32);
	LCD_WriteData(0x36);
	LCD_WriteData(0x3f);
	LCD_WriteData(0x47);
	LCD_WriteData(0x50);
	LCD_WriteData(0x59);
	LCD_WriteData(0x60);
	LCD_WriteData(0x68);
	LCD_WriteData(0x71);
	LCD_WriteData(0x7B);
	LCD_WriteData(0x82);
	LCD_WriteData(0x89);
	LCD_WriteData(0x91);
	LCD_WriteData(0x98);
	LCD_WriteData(0xA0);
	LCD_WriteData(0xA8);
	LCD_WriteData(0xB0);
	LCD_WriteData(0xB8);
	LCD_WriteData(0xC1);
	LCD_WriteData(0xC9);
	LCD_WriteData(0xD0);
	LCD_WriteData(0xD7);
	LCD_WriteData(0xE0);
	LCD_WriteData(0xE7);
	LCD_WriteData(0xEF);
	LCD_WriteData(0xF7);
	LCD_WriteData(0xFE);
	LCD_WriteData(0xCF);
	LCD_WriteData(0x52);
	LCD_WriteData(0x34);
	LCD_WriteData(0xF8);
	LCD_WriteData(0x51);
	LCD_WriteData(0xF5);
	LCD_WriteData(0x9D);
	LCD_WriteData(0x75);
	LCD_WriteData(0x00);
	//G 
	LCD_WriteData(0x04);
	LCD_WriteData(0x13);
	LCD_WriteData(0x1a);
	LCD_WriteData(0x20);
	LCD_WriteData(0x27);
	LCD_WriteData(0x2c);
	LCD_WriteData(0x32);
	LCD_WriteData(0x36);
	LCD_WriteData(0x3f);
	LCD_WriteData(0x47);
	LCD_WriteData(0x50);
	LCD_WriteData(0x59);
	LCD_WriteData(0x60);
	LCD_WriteData(0x68);
	LCD_WriteData(0x71);
	LCD_WriteData(0x7B);
	LCD_WriteData(0x82);
	LCD_WriteData(0x89);
	LCD_WriteData(0x91);
	LCD_WriteData(0x98);
	LCD_WriteData(0xA0);
	LCD_WriteData(0xA8);
	LCD_WriteData(0xB0);
	LCD_WriteData(0xB8);
	LCD_WriteData(0xC1);
	LCD_WriteData(0xC9);
	LCD_WriteData(0xD0);
	LCD_WriteData(0xD7);
	LCD_WriteData(0xE0);
	LCD_WriteData(0xE7);
	LCD_WriteData(0xEF);
	LCD_WriteData(0xF7);
	LCD_WriteData(0xFE);
	LCD_WriteData(0xCF);
	LCD_WriteData(0x52);
	LCD_WriteData(0x34);
	LCD_WriteData(0xF8);
	LCD_WriteData(0x51);
	LCD_WriteData(0xF5);
	LCD_WriteData(0x9D);
	LCD_WriteData(0x75);
	LCD_WriteData(0x00);
	//B 
	LCD_WriteData(0x04);
	LCD_WriteData(0x13);
	LCD_WriteData(0x1a);
	LCD_WriteData(0x20);
	LCD_WriteData(0x27);
	LCD_WriteData(0x2c);
	LCD_WriteData(0x32);
	LCD_WriteData(0x36);
	LCD_WriteData(0x3f);
	LCD_WriteData(0x47);
	LCD_WriteData(0x50);
	LCD_WriteData(0x59);
	LCD_WriteData(0x60);
	LCD_WriteData(0x68);
	LCD_WriteData(0x71);
	LCD_WriteData(0x7B);
	LCD_WriteData(0x82);
	LCD_WriteData(0x89);
	LCD_WriteData(0x91);
	LCD_WriteData(0x98);
	LCD_WriteData(0xA0);
	LCD_WriteData(0xA8);
	LCD_WriteData(0xB0);
	LCD_WriteData(0xB8);
	LCD_WriteData(0xC1);
	LCD_WriteData(0xC9);
	LCD_WriteData(0xD0);
	LCD_WriteData(0xD7);
	LCD_WriteData(0xE0);
	LCD_WriteData(0xE7);
	LCD_WriteData(0xEF);
	LCD_WriteData(0xF7);
	LCD_WriteData(0xFE);
	LCD_WriteData(0xCF);
	LCD_WriteData(0x52);
	LCD_WriteData(0x34);
	LCD_WriteData(0xF8);
	LCD_WriteData(0x51);
	LCD_WriteData(0xF5);
	LCD_WriteData(0x9D);
	LCD_WriteData(0x75);
	LCD_WriteData(0x00);
	delay_us(10);

	LCD_WriteCommand0(0x11);
	delay_us(120);

	LCD_WriteCommand0(0x29);

	LCD_WriteCommand0(0x2C);
	delay_us(10);
	
	LCD_WriteCommand0(0x11);
	delay_us(120);
#endif	
}

